Tekla.Structures.DirectManipulation.Adapter.State.StateHandler
The Tekla.Structures.DirectManipulation.Adapter.State.StateHandler class exposes the state of the connected Tekla Structures.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.MaximumAmountOfSelectedObjects
The maximum number of selected objects that may be processed by the platform.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.tolerationHandler
The toleration handler.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.#ctor(Tekla.BIM.DirectManipulation.Services.Selection.ISelectorEvents,Tekla.BIM.DirectManipulation.Adapters.ITolerationHandler)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.State.StateHandler class.
selectorEvents: The selector events.
tolerationHandler: The toleration handler.
Throws System.ArgumentNullException:
selectorEvents
or
tolerationHandler

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.CommandStarted
Occurs when the direct manipulation API receives a command from the adapted platform.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.Interrupted
Occurs when the user presses escape or in another way causes an interrupt in the adapted platform.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.ModelChanged
Occurs when the opened model is changed.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.SelectionChanged
Occurs when the user changes the current selection inside the adapted platform.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.AppliedValuesChanged
Occurs when the applied values are changed.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.StateStorage
Gets the model object selection state.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.IsDmActive
Determines whether DM is active.
Returns: A value indicating whether DM is active.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.GetSelectionChangedEventArgs
Get the selection changed event arguments
Returns: Selection changed event arguments

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.GetSelectedObjects(Tekla.BIM.DirectManipulation.Services.State.SelectionChangedEventArgs)
Gets the selected model objects from the eventArgs.
eventArgs: The selection changed event arguments.
Returns: The list of selected model objects from the eventArgs.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.OnCommandEnded(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Handles the end event of any command.
commandData: A value describing the ended command.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.OnCommandStarted(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Handles the start event of any command.
commandData: A value describing the started command.
Returns: True if the command start is consumed; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.OnInterrupted(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.Interrupted event.
param: No data expected.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.DoesCommandChangeObjectType(Tekla.BIM.DirectManipulation.Services.State.CommandDescriptor)
Examines whether the command changes type of the object it is applied for.
command: The command.
Returns: True if the command changes object type and false otherwise.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.OnModelChanged(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.ModelChanged event.
param: No data expected.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.RaiseSelectionChangedEvent(Tekla.BIM.DirectManipulation.Services.State.SelectionChangedEventArgs)
Raises selection changed event.
eventArgs: The Tekla.BIM.DirectManipulation.Services.State.SelectionChangedEventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.OnSelectionChanged(System.Object,Tekla.BIM.DirectManipulation.Services.Selection.SelectionEventArgs)
Called when the selection has been changed.
sender: The sender.
selectionEventArgs: The Tekla.BIM.DirectManipulation.Services.Selection.SelectionEventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.RefreshStateBasedOnSelection(System.String)
Refreshes the state based on selection.
param: The parameter.

Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.OnAppliedValuesChanged(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.State.StateHandler.AppliedValuesChanged event.
param: No data expected.